In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql
SELECT  MIN(population) AS 'Minimum population',
        MAX(population) AS 'Maximum population',
        MIN(population_growth) AS 'Minimum population growth',
        MAX(population_growth) AS 'Maximum population growth'
  FROM  facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [5]:
%%sql
SELECT name AS country, population 
  FROM facts
  WHERE population == (SELECT MIN(population)
                        FROM facts
                      );

Done.

[('Antarctica', 0)]

In [6]:
%%sql
SELECT  MIN (population) AS 'Minimum population',
        MAX (population) AS 'Maximum population',
        MIN (population_growth) AS 'Minimum population growth',
        MAX (population_growth) AS 'Maximum population growth'
        FROM facts
        WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [7]:
%%sql
SELECT ROUND(AVG(population),0) AS 'Average population',
       ROUND(AVG(area),2) AS 'Average area'
    FROM facts
    WHERE name != 'World';

Done.

[(32242667.0, 555093.55)]

In [8]:
%%sql
 SELECT name AS country, population, area
    FROM facts
    WHERE population > (SELECT AVG(population)
                         FROM facts
                        WHERE name != 'World'
                       )
    AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name != 'World'
               );

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Iraq', 37056169, 438317),
 ('Italy', 61855120, 301340),
 ('Japan', 126919659, 377915),
 ('Korea, South', 49115196, 99720),
 ('Morocco', 33322699, 446550),
 ('Philippines', 100998376, 300000),
 ('Poland', 38562189, 312685),
 ('Spain', 48146134, 505370),
 ('Thailand', 67976405, 513120),
 ('Uganda', 37101745, 241038),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

In [9]:
%%sql 
 SELECT name AS country, population
    FROM facts
    WHERE population == (SELECT MAX(population)
                           FROM facts
                           WHERE name != 'World'
                        );

Done.

[('China', 1367485388)]

In [10]:
%%sql
 SELECT name AS country, population_growth AS growth_rate
    FROM facts
    WHERE population_growth == (SELECT MAX(population_growth)
                         FROM facts
                         WHERE name != 'World'
                         );

Done.

[('South Sudan', 4.02)]

In [11]:
%%sql
 SELECT name AS counrty, area_water, area_land,
    ROUND (CAST(area_water AS float)/CAST(area_land AS float),1) AS water_to_land_ratio
    FROM facts
    ORDER BY water_to_land_ratio DESC
    LIMIT 10;

Done.

[('British Indian Ocean Territory', 54340, 60, 905.7),
 ('Virgin Islands', 1564, 346, 4.5),
 ('Puerto Rico', 4921, 8870, 0.6),
 ('Bahamas, The', 3870, 10010, 0.4),
 ('Guinea-Bissau', 8005, 28120, 0.3),
 ('Malawi', 24404, 94080, 0.3),
 ('Eritrea', 16600, 101000, 0.2),
 ('Liberia', 15049, 96320, 0.2),
 ('Netherlands', 7650, 33893, 0.2),
 ('Uganda', 43938, 197100, 0.2)]

In [12]:
%%sql
SELECT name AS country, population, population_growth,
    ROUND(CAST(population AS Float)/100 * population_growth,0) AS added_population
    FROM facts
    WHERE name != 'World'
    ORDER BY  ROUND(CAST(population AS Float)/100 * population_growth,0) DESC
    LIMIT 10;

Done.

[('India', 1251695584, 1.22, 15270686.0),
 ('China', 1367485388, 0.45, 6153684.0),
 ('Nigeria', 181562056, 2.45, 4448270.0),
 ('Pakistan', 199085847, 1.46, 2906653.0),
 ('Ethiopia', 99465819, 2.89, 2874562.0),
 ('Bangladesh', 168957745, 1.6, 2703324.0),
 ('United States', 321368864, 0.78, 2506677.0),
 ('Indonesia', 255993674, 0.92, 2355142.0),
 ('Congo, Democratic Republic of the', 79375136, 2.45, 1944691.0),
 ('Philippines', 100998376, 1.61, 1626074.0)]

In [13]:
%%sql 
SELECT name AS country, birth_rate, death_rate
  FROM facts
WHERE birth_rate < death_rate
LIMIT 10;

Done.

[('Austria', 9.41, 9.42),
 ('Belarus', 10.7, 13.36),
 ('Bosnia and Herzegovina', 8.87, 9.75),
 ('Bulgaria', 8.92, 14.44),
 ('Croatia', 9.45, 12.18),
 ('Czech Republic', 9.63, 10.34),
 ('Estonia', 10.51, 12.4),
 ('Germany', 8.47, 11.42),
 ('Greece', 8.66, 11.09),
 ('Hungary', 9.16, 12.73)]

In [17]:
%%sql 
SELECT name AS country, population, area,
       ROUND(CAST(population AS Float)/area,2) AS 'population/area'
    FROM facts
    ORDER BY ROUND(CAST(population AS Float)/area,2) DESC
    LIMIT 10;

Done.

[('Macau', 592731, 28, 21168.96),
 ('Monaco', 30535, 2, 15267.5),
 ('Singapore', 5674472, 697, 8141.28),
 ('Hong Kong', 7141106, 1108, 6445.04),
 ('Gaza Strip', 1869055, 360, 5191.82),
 ('Gibraltar', 29258, 6, 4876.33),
 ('Bahrain', 1346613, 760, 1771.86),
 ('Maldives', 393253, 298, 1319.64),
 ('Malta', 413965, 316, 1310.02),
 ('Bermuda', 70196, 54, 1299.93)]